views/admin/update.php

SELECT `title`, `id` FROM `marka`
SELECT `title`, `id` FROM `fuel_type`
SELECT `title`, `id` FROM `transmission_type`
---

<?= $form->field($model, 'description')->textarea() ?>

<?= $form->field($model, 'marka_id')->dropDownList(
    \app\models\Marka::find()->select(['title', 'id'])->indexBy('id')->column()
) ?>
<?= $form->field($model, 'model')->textInput() ?>
<?= $form->field($model, 'year')->textInput() ?>

<?= $form->field($model, 'fuel_type_id')->dropDownList(
    \app\models\FuelType::find()->select(['title', 'id'])->indexBy('id')->column()
) ?>

<?= $form->field($model, 'transmission_type_id')->dropDownList(
    \app\models\TransmissionType::find()->select(['title', 'id'])->indexBy('id')->column()
) ?>