controllers/AdminController.php

public function actionUpdateCar($id)
{
    $model = \app\models\Car::findOne($id);

    if (!$model) {
        throw new \yii\web\NotFoundHttpException();
    }

    if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `car` WHERE `id`='1'
UPDATE `car` SET `transmission_type_id`=1, `fuel_type_id`=1, `marka_id`=1, `price`=19000, `engine_power`=190, `year`=2018 WHERE `id`=1

    public function actionApplications()
    {
        $applications = \app\models\Application::find()
            ->with(['car.marka', 'status'])
            ->all();
---
SELECT * FROM `application`
SELECT * FROM `car` WHERE `id` IN (1, 2)
SELECT * FROM `marka` WHERE `id` IN (1, 4)
SELECT * FROM `status` WHERE `id`=3