controllers/CarController.php

SELECT * FROM `car` WHERE `id`='1'
SELECT * FROM `category`
---
   public function actionIndex()
{
    $query = Car::find();

    $filters = Yii::$app->request->get('filters');

    if ($filters) {

        foreach ($filters as $categoryId => $characteristicId) {

    if ($characteristicId) {

        $query->andWhere([
            'id' => \app\models\CarCharacteristic::find()
                ->select('car_id')
                ->where([
                    'characteristic_id' =>
                        $characteristicId
                ])
        ]);
    }
}
    }

    $cars = $query->all();

    return $this->render('index', [
        'cars' => $cars,
        'categories' => \app\models\Category::find()->all(),

SELECT * FROM `car` WHERE `id`='1'
---
public function actionView($id)
{


    $car = Car::findOne($id);