views/car/index.php


        <?php

        $items = \app\models\Characteristic::find()
            ->where(['category_id' => $category->id])
            ->all();
---
SELECT * FROM `characteristic` WHERE `category_id`=1