views/car/view.php

$characteristics = [];
foreach ($car->carCharacteristics as $cc) {
    if ($cc->characteristic && $cc->characteristic->category) {
        $characteristics[$cc->characteristic->category->name] = $cc->characteristic->value;
---
SELECT * FROM `car_characteristic` WHERE `car_id`=1
SELECT * FROM `category` WHERE `id`=1
SELECT * FROM `characteristic` WHERE `id`=6

}

// Получаем все категории, которые есть в системе (для отображения отсутствующих)
$allCategories = \app\models\Category::find()->all();
---
SELECT * FROM `category`

            <?= $form->field($application, 'start_date')->input('date') ?>
            <?= $form->field($application, 'end_date')->input('date') ?>

            <?= $form->field($application, 'pay_type_id')->dropDownList(
                \app\models\PayType::find()->select(['title', 'id'])->indexBy('id')->column(),
                ['prompt' => 'Выберите тип оплаты']
            ) ?>
---
SELECT `title`, `id` FROM `pay_type`