views/site/index.php

    <div class="cars-grid">

        <?php
        $cars = \app\models\Car::find()->limit(3)->all();
---
SELECT * FROM `car` LIMIT 3