models/Car.php

SELECT * FROM `category` WHERE `name`='Топливо'
SELECT `car_characteristic`.* FROM `car_characteristic` LEFT JOIN `characteristic` ON `car_characteristic`.`characteristic_id` = `characteristic`.`id` WHERE (`car_characteristic`.`car_id`=1) AND (`characteristic`.`category_id`=2)
SELECT * FROM `characteristic` WHERE `id`=2
---
public function getCharacteristic($categoryName)
    {
        // Находим категорию по названию
        $category = Category::find()->where(['name' => $categoryName])->one();

        if (!$category) {
            return null;
        }

        // Находим характеристику автомобиля для этой категории
        $carCharacteristic = CarCharacteristic::find()
            ->joinWith('characteristic')
            ->where([
                'car_characteristic.car_id' => $this->id,
                'characteristic.category_id' => $category->id
            ])
            ->one();

        if ($carCharacteristic && $carCharacteristic->characteristic) {
            return $carCharacteristic->characteristic->value;

SELECT * FROM `car_characteristic` WHERE `car_id`=1
SELECT * FROM `characteristic` WHERE `id`=6
---
   public function getCharacteristicsArray()
{
    $result = [];
    foreach ($this->carCharacteristics as $carCharacteristic) {
        if ($carCharacteristic->characteristic && $carCharacteristic->characteristic->category) {
            $categoryName = $carCharacteristic->characteristic->category->name;
            $result[$categoryName] = $carCharacteristic->characteristic->value;