models/Status.php

SELECT `id` FROM `status` WHERE `alias`='new'
---
    public static function getIdByAlias($alias)
{
    return self::find()
        ->select('id')
        ->where(['alias' => $alias])
        ->scalar();