models/User.php

    public static function  findByUsername(string $login): bool|User
    {
        return static::findOne(['login' => $login]) ?? false;
---
SELECT * FROM `user` WHERE `login`='admin'